# IsValidColumn Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColumnAttachment..::..IsValidColumn Method
ColumnAttachment Class See Also
---
Says whether a FamilyInstance supports column attachments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsValidColumn(
	FamilyInstance familyInstance
)
```

Visual Basic
---
```text
Public Shared Function IsValidColumn ( _
	familyInstance As FamilyInstance _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidColumn(
	FamilyInstance^ familyInstance
)
```

# ### Parameters
familyInstance
    Type: Autodesk.Revit.DB..::..FamilyInstance A column.
# Remarks
In-place columns do not support attachments.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ColumnAttachment Class
Autodesk.Revit.DB Namespace